#!/usr/bin/python3
# -*- coding: utf-8 -*-
# @Time    : 2020-02-21 21:11
# @Author  : 小苏
# @Email   : 737029580@qq.com
# @File    : gq_ht_gm.py
# @Software: PyCharm

#                                                    __----~~~~~~~~~~~------___
#                                   .  .   ~~//====......          __--~ ~~
#                   -.            \_|//     |||\\  ~~~~~~::::... /~
#                ___-==_       _-~o~  \/    |||  \\            _/~~-
#        __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~
#    _-~~     .=~    |  \\-_    '-~7  /-   /  ||    \      /
#  .~       .~       |   \\ -_    /  /-   /   ||      \   /
# /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /
# |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~        .\
#          '         ~-|      /|    |-~\~~       __--~~
#                      |-~~-_/ |    |   ~\_   _-~            /\
#                           /  \     \__   \/~                \__
#                       _--~ _/ | .-~~____--~-/                  ~~==.
#                      ((->/~   '.|||' -_|    ~~-/ ,              . _||
#                                 -_     ~\      ~~---l__i__i__i--~~_/
#                                 _-~-__   ~)  \--______________--~~
#                               //.-~~~-~_--~- |-------~~~~~~~~
#                                      //.-~~~--\
#               神兽保佑
#                  永无BUG!

title = '海豚加速器改密'

import requests

class HaiTun():

    def __init__(self):

        pass

    def ht_login(self):
        ## 海豚web登录
        pass

    def ht_sent_code(self):
        ## 海豚发送验证码
        pass

    def ht_pull_code(self):
        ## 海豚提交验证码
        pass

    def ht_amend_pwd(self):
        ## 海豚修改新密码
        pass
